/***************力邦测控（洛阳）有限公司**********************/
/*文件功能：系统设置
/*作者：田世通
/*创建日期日期：2019-12-16
/*
/*最后修改日期：
/***********************************************************/
#include "system.h"

void IO_init(void)
{
    P0M0 = 0X00;    P0M1 = 0X00;
    P1M0 = 0X00;    P1M1 = 0X00;
    P2M0 = 0X00;    P2M1 = 0X00;
    P3M0 = 0X00;    P3M1 = 0X00;
    P4M0 = 0X00;    P4M1 = 0X00;
    P5M0 = 0X00;    P5M1 = 0X00;
}

void delayms(unsigned int m)
{
        int a, b;
        for(a=0;a<5000;a++)
        for(b=0;b<m;b++);
}